# SlantedColumnEndPlanesHaveFlipped Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FamilyFailures..::..SlantedColumnEndPlanesHaveFlipped Property
BuiltInFailures..::..FamilyFailures Class See Also
---
Position of end cut planes has resulted in a slanted column without any geometry.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId SlantedColumnEndPlanesHaveFlipped { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SlantedColumnEndPlanesHaveFlipped As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ SlantedColumnEndPlanesHaveFlipped {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FamilyFailures Class
Autodesk.Revit.DB Namespace